%建立符号变量a(发展系数)和b(灰作用量)
syms a b;
c = [a b]';

%原始数列 A
A = input('A='); %格式[a1,a2L,a3]
n = length(A);

%对原始数列 A 做累减得到数列 B
for i = 2:n
    H(i) = A(i) - A(i - 1);
end
H(1) = [];


%对原始数列 A 做紧邻均值生成
for i = 2:n
    C(i) = (A(i) + A(i-1))/2;
end
C(1) = [];

%构造数据矩阵 
D = [-C; C.^2];
Y = H; Y = Y';

%使用最小二乘法计算参数 a(发展系数)和b(灰作用量)
c = inv(D*D')*D*Y;
c = c';
a = c(1); b = c(2);

%得到预测出的数据
F = []; F(1) = A(1);
for i = 2:(n+n)
    F(i) = (a*A(1))/(b*A(1)+(a - b*A(1))*exp(a*(i-1)));
end

disp('预测数据为：');
F

%绘制曲线图
t1 = 0:n-1;  %原始数据横坐标范围----------------------------------------------------------
t2 = 0:2*n-1;  %预测数据横坐标范围-------------------------------------------------------------
plot(t1, A, 'ro'); hold on;
plot(t2, F);
%图形参数
xlabel('x'); ylabel('y');  %----------------------------------------------------------
legend('原始数据','预测值');%----------------------------------------------------------
title('曲线');%----------------------------------------------------------
grid on;